Script started on Saturday 22 April 2017 10:00:34 AM IST
I don't deserve this award, but I have arthritis and I don't deserve that
either.
		-- Jack Benny
]0;jarvis@jarvis: ~/Sem2/mos/assignment 3/prep/learn/gdb[01;32mjarvis@jarvis[00m:[01;34m~/Sem2/mos/assignment 3/prep/learn/gdb[00m$ date
Sat Apr 22 10:00:41 IST 2017
]0;jarvis@jarvis: ~/Sem2/mos/assignment 3/prep/learn/gdb[01;32mjarvis@jarvis[00m:[01;34m~/Sem2/mos/assignment 3/prep/learn/gdb[00m$ authoreauthorcauthorhauthoroauthor author[C[C[C[C[C[C Deepika
author Deepika
]0;jarvis@jarvis: ~/Sem2/mos/assignment 3/prep/learn/gdb[01;32mjarvis@jarvis[00m:[01;34m~/Sem2/mos/assignment 3/prep/learn/gdb[00m$ echo DE[K[KUndestanding D[KGDB
Undestanding GDB
]0;jarvis@jarvis: ~/Sem2/mos/assignment 3/prep/learn/gdb[01;32mjarvis@jarvis[00m:[01;34m~/Sem2/mos/assignment 3/prep/learn/gdb[00m$ gcc -g debug.c -o debug

]0;jarvis@jarvis: ~/Sem2/mos/assignment 3/prep/learn/gdb[01;32mjarvis@jarvis[00m:[01;34m~/Sem2/mos/assignment 3/prep/learn/gdb[00m$ 
]0;jarvis@jarvis: ~/Sem2/mos/assignment 3/prep/learn/gdb[01;32mjarvis@jarvis[00m:[01;34m~/Sem2/mos/assignment 3/prep/learn/gdb[00m$ gdb deg[Kbug
GNU gdb (Ubuntu 7.11.1-0ubuntu1~16.04) 7.11.1
Copyright (C) 2016 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from debug...done.
(gdb) run
Starting program: /home/jarvis/Sem2/mos/assignment 3/prep/learn/gdb/debug 
Value of a is 0 
[Inferior 1 (process 6866) exited normally]
(gdb) list
1	/*Sample program for understanding how GDB works */
2	#include<stdio.h>
3	
4	int main()
5	{
6		int a=0;
7		int b=1;
8		int c=2;
9		int d=3;
10		printf("Value of a is %d \n", a);
(gdb) list 1,14
1	/*Sample program for understanding how GDB works */
2	#include<stdio.h>
3	
4	int main()
5	{
6		int a=0;
7		int b=1;
8		int c=2;
9		int d=3;
10		printf("Value of a is %d \n", a);
11		return 0;
12	}
13		
(gdb) break 7
Breakpoint 1 at 0x400535: file debug.c, line 7.
(gdb) run
Starting program: /home/jarvis/Sem2/mos/assignment 3/prep/learn/gdb/debug 

Breakpoint 1, main () at debug.c:7
7		int b=1;
(gdb) info loac[K[Kcals
a = 0
b = 32767
c = 0
d = 0
(gdb) next
8		int c=2;
(gdb) nextinfo locals
a = 0
b = 1
c = 0
d = 0
(gdb) print a
$1 = 0
(gdb) print a[Kb
$2 = 1
(gdb) brea[K[K[K 11
Breakpoint 2 at 0x40055e: file debug.c, line 11.
(gdb) run[K[K[Koc[Kc[K[Kcontinue
Continuing.
Value of a is 0 

Breakpoint 2, main () at debug.c:11
11		return 0;
(gdb) break 10
Breakpoint 3 at 0x40054a: file debug.c, line 10.
(gdb) run
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /home/jarvis/Sem2/mos/assignment 3/prep/learn/gdb/debug 

Breakpoint 1, main () at debug.c:7
7		int b=1;
(gdb) next
8		int c=2;
(gdb) next
9		int d=3;
(gdb) next

Breakpoint 3, main () at debug.c:10
10		printf("Value of a is %d \n", a);
(gdb) u[Kinfo b
Num     Type           Disp Enb Address            What
1       breakpoint     keep y   0x0000000000400535 in main at debug.c:7
	breakpoint already hit 1 time
2       breakpoint     keep y   0x000000000040055e in main at debug.c:11
3       breakpoint     keep y   0x000000000040054a in main at debug.c:10
	breakpoint already hit 1 time
(gdb) info breakpoint
Num     Type           Disp Enb Address            What
1       breakpoint     keep y   0x0000000000400535 in main at debug.c:7
	breakpoint already hit 1 time
2       breakpoint     keep y   0x000000000040055e in main at debug.c:11
3       breakpoint     keep y   0x000000000040054a in main at debug.c:10
	breakpoint already hit 1 time
(gdb) de[K 2
(gdb) d 2info breakpoint
Num     Type           Disp Enb Address            What
1       breakpoint     keep y   0x0000000000400535 in main at debug.c:7
	breakpoint already hit 1 time
3       breakpoint     keep y   0x000000000040054a in main at debug.c:10
	breakpoint already hit 1 time
(gdb) continnu[K[Kue
Continuing.
Value of a is 0 
[Inferior 1 (process 6886) exited normally]
(gdb) d 1
(gdb) d 3
(gdb) run
Starting program: /home/jarvis/Sem2/mos/assignment 3/prep/learn/gdb/debug 
Value of a is 0 
[Inferior 1 (process 6893) exited normally]
(gdb) exit
Undefined command: "exit".  Try "help".
(gdb) help
List of classes of commands:

aliases -- Aliases of other commands
breakpoints -- Making program stop at certain points
data -- Examining data
files -- Specifying and examining files
internals -- Maintenance commands
obscure -- Obscure features
running -- Running the program
stack -- Examining the stack
status -- Status inquiries
support -- Support facilities
tracepoints -- Tracing of program execution without stopping the program
user-defined -- User-defined commands

Type "help" followed by a class name for a list of commands in that class.
Type "help all" for the list of all commands.
Type "help" followed by command name for full documentation.
Type "apropos word" to search for commands related to "word".
Command name abbreviations are allowed if unambiguous.
(gdb) apropos [K[K[K[K[K[K[K[K"app[Kropos exit"
Undefined command: "".  Try "help".
(gdb) "apropos exit"[K[K[K[K[K[K[K[K[K[K[K[K[K[Kq
]0;jarvis@jarvis: ~/Sem2/mos/assignment 3/prep/learn/gdb[01;32mjarvis@jarvis[00m:[01;34m~/Sem2/mos/assignment 3/prep/learn/gdb[00m$ exit
exit

Script done on Saturday 22 April 2017 10:11:03 AM IST
